# parameters
nc: 17  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# RGB-D YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0
   [-2, 1, Focus, [64, 3]],#1
   [-2, 1, Conv, [128, 3, 2]],  # 2
   [-2, 1, Conv, [128, 3, 2]],#3
   [-2, 3, C3, [128]],#4
   [-2, 3, C3, [128]],#5

   [[-1,-2], 1, Fusion, [128]],#6

   [-2, 1, Conv, [256, 3, 2]],  # 7
   [-2, 1, Conv, [256, 3, 2]],#8
   [-2, 9, C3, [256]],#9
   [-2, 9, C3, [256]],#10

   [[-1,-2], 1, Fusion, [256]],#11

   [-2, 1, Conv, [512, 3, 2]],  # 12
   [-2, 1, Conv, [512, 3, 2]],  # 13
   [-2, 9, C3, [512]],  # 14
   [-2, 9, C3, [512]],  # 15

   [[-1,-2], 1, Fusion, [512]],  # 16

   [-2, 1, Conv, [1024, 3, 2]],  # 17
   [-2, 1, Conv, [1024, 3, 2]],  # 18
   [-2, 1, SPP, [1024, [5, 9, 13]]], # 19
   [-2, 1, SPP, [1024, [5, 9, 13]]], # 20
   [-2, 3, C3, [1024, False]],  # 21
   [-2, 3, C3, [1024, False]],  # 22

   [[-1,-2], 1, Fusion, [1024]], # 23

  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]], # 24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 25
   [[-1, 14,15], 1, Concat, [1]],  # 26
   [-1, 3, C3, [512, False]],  # 27

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9,10], 1, Concat, [1]],  # cat backbone 4
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 28], 1, Concat, [1]],  # cat head 14
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 24], 1, Concat, [1]],  # cat head 10
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[31, 34, 37], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5) 17 20 23
  ]
